---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCuttingSurfaceGeneralProblem
source: html/c548133b-7ba8-a7bf-701a-002382af8487.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCuttingSurfaceGeneralProblem Property

Cannot process a surface-based splitter

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCuttingSurfaceGeneralProblem { get; }
```